# AnalyticalModelColumn Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelColumn Class
Members See Also
---
An element that represents the structural analytical model column.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class AnalyticalModelColumn : AnalyticalModelStick
```

Visual Basic
---
```text
Public Class AnalyticalModelColumn _
	Inherits AnalyticalModelStick
```

Visual C++
---
```text
public ref class AnalyticalModelColumn : public AnalyticalModelStick
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..AnalyticalModel Autodesk.Revit.DB.Structure..::..AnalyticalModelStick Autodesk.Revit.DB.Structure..::..AnalyticalModelColumn
# See Also
AnalyticalModelColumn Members
Autodesk.Revit.DB.Structure Namespace